a = set("Hello")
print(type(a))
print(a)

b = {'23', 32}
print(type(b))
print(b)

c = {i ** 2 for i in range(10)}
c = {23}                            # множество
print(type(c))
print(c)

d = set("Hello")                    # несколько аргументов
e = frozenset('Qwerty')             # один аргумент
d.add(1)
print(d)
print(e)

f = ['r', 's', 'w', 'a', 's', 'w']
print(f)                            # выводит всё
print(set(f))                       # повторяющие значения не выводит

j = {32, 45, 43.23, 76}
x = 56
k = 45
print(x in j)
print(k in j)

j = {32, 45, 43.23, 76}
x = {67, 34, 90}
print(j.isdisjoint(x))               # Если все элементы не совпадают то True

j = {32, 45, 43.23, 76}
x = {32, 45, 43.23, 76}
print(j == x)                        # Если все элементы совпадают то True

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 76}
j.update(x)                          # Обьединяет два множества
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.intersection_update(x)             # Выводит одинаковые числа
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.difference_update(x)               # Значения которые есть в j но нет в х
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.symmetric_difference_update(x)     # Убирает одинаковые значения
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.remove(32)                         # Удаляет элемент
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}         # Удаляет элемент без ошибки, если его нет
j.discard(33)
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.pop()                         # Удаляет рандомный элемент
print(j)

j = {32, 45, 43.23, 76}
x = {23, 45, 43.23, 12}
j.clear()                       # Очищает всё множество set
print(j)
